# StairstypeNotchHorizontalGap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeNotchHorizontalGap Property
ParameterTypeId Class See Also
---
"Horizontal Gap Distance":
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeNotchHorizontalGap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeNotchHorizontalGap As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeNotchHorizontalGap {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace